iarsystems/ewarm-toshiba-example-projects/TMPM4NR/Libraries/TMPM4NQ.h
/**
  * @brief USB interface
  */
typedef struct
{
  __IO uint32_t GOTGCTL;           /*!< OTG Control and Status Register              */
  __IO uint32_t GOTGINT;           /*!< OTG Interrupt Register                       */
  __IO uint32_t GAHBCFG;           /*!< AHB Configuration Register                   */
  __IO uint32_t GUSBCFG;           /*!< USB Configuration Register                   */
  __IO uint32_t GRSTCTL;           /*!< Reset Register                               */
  __IO uint32_t GINTSTS;           /*!< Interrupt Register                           */
  __IO uint32_t GINTMSK;           /*!< Interrupt Mask Register                      */
  __I  uint32_t GRXSTSR;           /*!< Receive Status Debug Read Register           */
  __I  uint32_t GRXSTSP;           /*!< Receive Status Read/Pop Register             */
  __IO uint32_t GRXFSIZ;           /*!< Receive FIFO Size Register                   */
  __IO uint32_t GNPTXFSIZ;         /*!< Non-periodic Transmit FIFO Size Register     */
  __I  uint32_t GNPTXSTS;          /*!< Non-periodic Transmit FIFO/Queue Status Register*/
       uint32_t RESERVED0[5];
  __I  uint32_t GHWCFG1;           /*!< User Hardware Configuration 1 Register       */
  __I  uint32_t GHWCFG2;           /*!< User Hardware Configuration 2 Register       */
  __I  uint32_t GHWCFG3;           /*!< User Hardware Configuration 3 Register       */
  __I  uint32_t GHWCFG4;           /*!< User Hardware Configuration 4 Register       */
       uint32_t RESERVED1[2];
  __IO uint32_t GDFIFOCFG;         /*!< Global DFIFO Configuration Register          */
       uint32_t RESERVED2[40];
  __IO uint32_t HPTXFSIZ;          /*!< Host Periodic Transmit FIFO Size Register    */
  __IO uint32_t DIEPTXF1;          /*!< Device IN Endpoint Transmit FIFO Size Register 1*/
  __IO uint32_t DIEPTXF2;          /*!< Device IN Endpoint Transmit FIFO Size Register 2*/
  __IO uint32_t DIEPTXF3;          /*!< Device IN Endpoint Transmit FIFO Size Register 3*/
  __IO uint32_t DIEPTXF4;          /*!< Device IN Endpoint Transmit FIFO Size Register 4*/
  __IO uint32_t DIEPTXF5;          /*!< Device IN Endpoint Transmit FIFO Size Register 5*/
       uint32_t RESERVED3[186];
  __IO uint32_t HCFG;              /*!< Host Configuration Register                  */
  __IO uint32_t HFIR;              /*!< Host Frame Interval Register                 */
  __I  uint32_t HFNUM;             /*!< Host Frame Number/Frame Time Remaining Register*/
       uint32_t RESERVED4;
  __I  uint32_t HPTXSTS;           /*!< Host Periodic Transmit FIFO/Queue Status Register*/
  __I  uint32_t HAINT;             /*!< Host All Channels Interrupt Register         */
  __IO uint32_t HAINTMSK;          /*!< Host All Channels Interrupt Mask Register    */
  __IO uint32_t HFLBADDR;          /*!< Host Frame List Base Address Register        */
       uint32_t RESERVED5[8];
  __IO uint32_t HPRT;              /*!< Host Port Control and Status Register        */
       uint32_t RESERVED6[47];
  __IO uint32_t HCCHAR0;           /*!< Host Channel 0 Characteristics Register      */
  __IO uint32_t HCSPLT0;           /*!< Host Channel 0 Split Control Register        */
  __IO uint32_t HCINT0;            /*!< Host Channel 0 Interrupt Register            */
  __IO uint32_t HCINTMSK0;         /*!< Host Channel 0 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ0;           /*!< Host Channel 0 Transfer Size Register        */
  __IO uint32_t HCDMA0;            /*!< Host Channel 0 DMA Address Register          */
       uint32_t RESERVED7;
  __I  uint32_t HCDMAB0;           /*!< Host Channel 0 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR1;           /*!< Host Channel 1 Characteristics Register      */
  __IO uint32_t HCSPLT1;           /*!< Host Channel 1 Split Control Register        */
  __IO uint32_t HCINT1;            /*!< Host Channel 1 Interrupt Register            */
  __IO uint32_t HCINTMSK1;         /*!< Host Channel 1 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ1;           /*!< Host Channel 1 Transfer Size Register        */
  __IO uint32_t HCDMA1;            /*!< Host Channel 1 DMA Address Register          */
       uint32_t RESERVED8;
  __I  uint32_t HCDMAB1;           /*!< Host Channel 1 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR2;           /*!< Host Channel 2 Characteristics Register      */
  __IO uint32_t HCSPLT2;           /*!< Host Channel 2 Split Control Register        */
  __IO uint32_t HCINT2;            /*!< Host Channel 2 Interrupt Register            */
  __IO uint32_t HCINTMSK2;         /*!< Host Channel 2 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ2;           /*!< Host Channel 2 Transfer Size Register        */
  __IO uint32_t HCDMA2;            /*!< Host Channel 2 DMA Address Register          */
       uint32_t RESERVED9;
  __I  uint32_t HCDMAB2;           /*!< Host Channel 2 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR3;           /*!< Host Channel 3 Characteristics Register      */
  __IO uint32_t HCSPLT3;           /*!< Host Channel 3 Split Control Register        */
  __IO uint32_t HCINT3;            /*!< Host Channel 3 Interrupt Register            */
  __IO uint32_t HCINTMSK3;         /*!< Host Channel 3 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ3;           /*!< Host Channel 3 Transfer Size Register        */
  __IO uint32_t HCDMA3;            /*!< Host Channel 3 DMA Address Register          */
       uint32_t RESERVED10;
  __I  uint32_t HCDMAB3;           /*!< Host Channel 3 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR4;           /*!< Host Channel 4 Characteristics Register      */
  __IO uint32_t HCSPLT4;           /*!< Host Channel 4 Split Control Register        */
  __IO uint32_t HCINT4;            /*!< Host Channel 4 Interrupt Register            */
  __IO uint32_t HCINTMSK4;         /*!< Host Channel 4 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ4;           /*!< Host Channel 4 Transfer Size Register        */
  __IO uint32_t HCDMA4;            /*!< Host Channel 4 DMA Address Register          */
       uint32_t RESERVED11;
  __I  uint32_t HCDMAB4;           /*!< Host Channel 4 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR5;           /*!< Host Channel 5 Characteristics Register      */
  __IO uint32_t HCSPLT5;           /*!< Host Channel 5 Split Control Register        */
  __IO uint32_t HCINT5;            /*!< Host Channel 5 Interrupt Register            */
  __IO uint32_t HCINTMSK5;         /*!< Host Channel 5 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ5;           /*!< Host Channel 5 Transfer Size Register        */
  __IO uint32_t HCDMA5;            /*!< Host Channel 5 DMA Address Register          */
       uint32_t RESERVED12;
  __I  uint32_t HCDMAB5;           /*!< Host Channel 5 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR6;           /*!< Host Channel 6 Characteristics Register      */
  __IO uint32_t HCSPLT6;           /*!< Host Channel 6 Split Control Register        */
  __IO uint32_t HCINT6;            /*!< Host Channel 6 Interrupt Register            */
  __IO uint32_t HCINTMSK6;         /*!< Host Channel 6 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ6;           /*!< Host Channel 6 Transfer Size Register        */
  __IO uint32_t HCDMA6;            /*!< Host Channel 6 DMA Address Register          */
       uint32_t RESERVED13;
  __I  uint32_t HCDMAB6;           /*!< Host Channel 6 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR7;           /*!< Host Channel 7 Characteristics Register      */
  __IO uint32_t HCSPLT7;           /*!< Host Channel 7 Split Control Register        */
  __IO uint32_t HCINT7;            /*!< Host Channel 7 Interrupt Register            */
  __IO uint32_t HCINTMSK7;         /*!< Host Channel 7 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ7;           /*!< Host Channel 7 Transfer Size Register        */
  __IO uint32_t HCDMA7;            /*!< Host Channel 7 DMA Address Register          */
       uint32_t RESERVED14;
  __I  uint32_t HCDMAB7;           /*!< Host Channel 7 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR8;           /*!< Host Channel 8 Characteristics Register      */
  __IO uint32_t HCSPLT8;           /*!< Host Channel 8 Split Control Register        */
  __IO uint32_t HCINT8;            /*!< Host Channel 8 Interrupt Register            */
  __IO uint32_t HCINTMSK8;         /*!< Host Channel 8 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ8;           /*!< Host Channel 8 Transfer Size Register        */
  __IO uint32_t HCDMA8;            /*!< Host Channel 8 DMA Address Register          */
       uint32_t RESERVED15;
  __I  uint32_t HCDMAB8;           /*!< Host Channel 8 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR9;           /*!< Host Channel 9 Characteristics Register      */
  __IO uint32_t HCSPLT9;           /*!< Host Channel 9 Split Control Register        */
  __IO uint32_t HCINT9;            /*!< Host Channel 9 Interrupt Register            */
  __IO uint32_t HCINTMSK9;         /*!< Host Channel 9 Interrupt Mask Register       */
  __IO uint32_t HCTSIZ9;           /*!< Host Channel 9 Transfer Size Register        */
  __IO uint32_t HCDMA9;            /*!< Host Channel 9 DMA Address Register          */
       uint32_t RESERVED16;
  __I  uint32_t HCDMAB9;           /*!< Host Channel 9 DMA Buffer Address Register   */
  __IO uint32_t HCCHAR10;          /*!< Host Channel 10 Characteristics Register     */
  __IO uint32_t HCSPLT10;          /*!< Host Channel 10 Split Control Register       */
  __IO uint32_t HCINT10;           /*!< Host Channel 10 Interrupt Register           */
  __IO uint32_t HCINTMSK10;        /*!< Host Channel 10 Interrupt Mask Register      */
  __IO uint32_t HCTSIZ10;          /*!< Host Channel 10 Transfer Size Register       */
  __IO uint32_t HCDMA10;           /*!< Host Channel 10 DMA Address Register         */
       uint32_t RESERVED17;
  __I  uint32_t HCDMAB10;          /*!< Host Channel 10 DMA Buffer Address Register  */
  __IO uint32_t HCCHAR11;          /*!< Host Channel 11 Characteristics Register     */
  __IO uint32_t HCSPLT11;          /*!< Host Channel 11 Split Control Register       */
  __IO uint32_t HCINT11;           /*!< Host Channel 11 Interrupt Register           */
  __IO uint32_t HCINTMSK11;        /*!< Host Channel 11 Interrupt Mask Register      */
  __IO uint32_t HCTSIZ11;          /*!< Host Channel 11 Transfer Size Register       */
  __IO uint32_t HCDMA11;           /*!< Host Channel 11 DMA Address Register         */
       uint32_t RESERVED18;
  __I  uint32_t HCDMAB11;          /*!< Host Channel 11 DMA Buffer Address Register  */
       uint32_t RESERVED19[96];
  __IO uint32_t DCFG;              /*!< Device Configuration Register                */
  __IO uint32_t DCTL;              /*!< Device Control Register                      */
  __I  uint32_t DSTS;              /*!< Device Status Register                       */
       uint32_t RESERVED20;
  __IO uint32_t DIEPMSK;           /*!< Device IN Endpoint Common Interrupt Mask Register*/
  __IO uint32_t DOEPMSK;           /*!< Device OUT Endpoint Common Interrupt Mask Register*/
  __I  uint32_t DAINT;             /*!< Device All Endpoints Interrupt Register      */
  __IO uint32_t DAINTMSK;          /*!< Device All Endpoints Interrupt Mask Register */
       uint32_t RESERVED21[2];
  __IO uint32_t DVBUSDIS;          /*!< Device VBUS Discharge Time Register          */
  __IO uint32_t DVBUSPULSE;        /*!< Device VBUS Pulsing Time Register            */
  __IO uint32_t DTHRCTL;           /*!< Device Threshold Control Register            */
  __IO uint32_t DIEPEMPMSK;        /*!< Device IN Endpoint FIFO Empty Interrupt Mask Register*/
       uint32_t RESERVED22[50];
  __IO uint32_t DIEPCTL0;          /*!< Device Control IN Endpoint 0 Control Register*/
       uint32_t RESERVED23;
  __IO uint32_t DIEPINT0;          /*!< Device IN Endpoint 0 Interrupt Register      */
       uint32_t RESERVED24;
  __IO uint32_t DIEPTSIZ0;         /*!< Device IN Endpoint 0 Transfer Size Register  */
  __IO uint32_t DIEPDMA0;          /*!< Device IN Endpoint 0 DMA Address Register    */
  __I  uint32_t DTXFSTS0;          /*!< Device IN Endpoint Transmit FIFO Status Register 0*/
  __I  uint32_t DIEPDMAB0;         /*!< Device IN Endpoint 16 Buffer Address Register*/
  __IO uint32_t DIEPCTL1;          /*!< Device Control IN Endpoint 1 Control Register*/
       uint32_t RESERVED25;
  __IO uint32_t DIEPINT1;          /*!< Device IN Endpoint 1 Interrupt Register      */
       uint32_t RESERVED26;
  __IO uint32_t DIEPTSIZ1;         /*!< Device IN Endpoint 1 Transfer Size Register. */
  __IO uint32_t DIEPDMA1;          /*!< Device IN Endpoint 1 DMA Address Register    */
  __I  uint32_t DTXFSTS1;          /*!< Device IN Endpoint Transmit FIFO Status Register 1*/
  __I  uint32_t DIEPDMAB1;         /*!< Device IN Endpoint 1 Buffer Address Register */
  __IO uint32_t DIEPCTL2;          /*!< Device Control IN Endpoint 2 Control Register*/
       uint32_t RESERVED27;
  __IO uint32_t DIEPINT2;          /*!< Device IN Endpoint 2 Interrupt Register      */
       uint32_t RESERVED28;
  __IO uint32_t DIEPTSIZ2;         /*!< Device IN Endpoint 2 Transfer Size Register. */
  __IO uint32_t DIEPDMA2;          /*!< Device IN Endpoint 2 DMA Address Register    */
  __I  uint32_t DTXFSTS2;          /*!< Device IN Endpoint Transmit FIFO Status Register 2*/
  __I  uint32_t DIEPDMAB2;         /*!< Device IN Endpoint 2 Buffer Address Register */
  __IO uint32_t DIEPCTL3;          /*!< Device Control IN Endpoint 3 Control Register*/
       uint32_t RESERVED29;
  __IO uint32_t DIEPINT3;          /*!< Device IN Endpoint 3 Interrupt Register      */
       uint32_t RESERVED30;
  __IO uint32_t DIEPTSIZ3;         /*!< Device IN Endpoint 3 Transfer Size Register. */
  __IO uint32_t DIEPDMA3;          /*!< Device IN Endpoint 3 DMA Address Register    */
  __I  uint32_t DTXFSTS3;          /*!< Device IN Endpoint Transmit FIFO Status Register 3*/
  __I  uint32_t DIEPDMAB3;         /*!< Device IN Endpoint 3 Buffer Address Register */
  __IO uint32_t DIEPCTL4;          /*!< Device Control IN Endpoint 4 Control Register*/
       uint32_t RESERVED31;
  __IO uint32_t DIEPINT4;          /*!< Device IN Endpoint 4 Interrupt Register      */
       uint32_t RESERVED32;
  __IO uint32_t DIEPTSIZ4;         /*!< Device IN Endpoint 4 Transfer Size Register. */
  __IO uint32_t DIEPDMA4;          /*!< Device IN Endpoint 4 DMA Address Register    */
  __I  uint32_t DTXFSTS4;          /*!< Device IN Endpoint Transmit FIFO Status Register 4*/
  __I  uint32_t DIEPDMAB4;         /*!< Device IN Endpoint 4 Buffer Address Register */
  __IO uint32_t DIEPCTL5;          /*!< Device Control IN Endpoint 5 Control Register*/
       uint32_t RESERVED33;
  __IO uint32_t DIEPINT5;          /*!< Device IN Endpoint 5 Interrupt Register      */
       uint32_t RESERVED34;
  __IO uint32_t DIEPTSIZ5;         /*!< Device IN Endpoint 5 Transfer Size Register. */
  __IO uint32_t DIEPDMA5;          /*!< Device IN Endpoint 5 DMA Address Register    */
  __I  uint32_t DTXFSTS5;          /*!< Device IN Endpoint Transmit FIFO Status Register 5*/
  __I  uint32_t DIEPDMAB5;         /*!< Device IN Endpoint 5 Buffer Address Register */
       uint32_t RESERVED35[80];
  __IO uint32_t DOEPCTL0;          /*!< Device Control OUT Endpoint 0 Control Register*/
       uint32_t RESERVED36;
  __IO uint32_t DOEPINT0;          /*!< Device OUT Endpoint 0 Interrupt Register     */
       uint32_t RESERVED37;
  __IO uint32_t DOEPTSIZ0;         /*!< Device OUT Endpoint 0 Transfer Size Register */
  __IO uint32_t DOEPDMA0;          /*!< Device OUT Endpoint 0 DMA Address Register   */
       uint32_t RESERVED38;
  __I  uint32_t DOEPDMAB0;         /*!< Device OUT Endpoint 16 Buffer Address Register*/
  __IO uint32_t DOEPCTL1;          /*!< Device Control OUT Endpoint 1 Control Register*/
       uint32_t RESERVED39;
  __IO uint32_t DOEPINT1;          /*!< Device OUT Endpoint 1 Interrupt Register     */
       uint32_t RESERVED40;
  __IO uint32_t DOEPTSIZ1;         /*!< Device OUT Endpoint 1 Transfer Size Register */
  __IO uint32_t DOEPDMA1;          /*!< Device OUT Endpoint 1 DMA Address Register   */
       uint32_t RESERVED41;
  __I  uint32_t DOEPDMAB1;         /*!< Device OUT Endpoint 1 Buffer Address Register*/
  __IO uint32_t DOEPCTL2;          /*!< Device Control OUT Endpoint 2 Control Register*/
       uint32_t RESERVED42;
  __IO uint32_t DOEPINT2;          /*!< Device OUT Endpoint 2 Interrupt Register     */
       uint32_t RESERVED43;
  __IO uint32_t DOEPTSIZ2;         /*!< Device OUT Endpoint 2 Transfer Size Register */
  __IO uint32_t DOEPDMA2;          /*!< Device OUT Endpoint 2 DMA Address Register   */
       uint32_t RESERVED44;
  __I  uint32_t DOEPDMAB2;         /*!< Device OUT Endpoint 2 Buffer Address Register*/
  __IO uint32_t DOEPCTL3;          /*!< Device Control OUT Endpoint 3 Control Register*/
       uint32_t RESERVED45;
  __IO uint32_t DOEPINT3;          /*!< Device OUT Endpoint 3 Interrupt Register     */
       uint32_t RESERVED46;
  __IO uint32_t DOEPTSIZ3;         /*!< Device OUT Endpoint 3 Transfer Size Register */
  __IO uint32_t DOEPDMA3;          /*!< Device OUT Endpoint 3 DMA Address Register   */
       uint32_t RESERVED47;
  __I  uint32_t DOEPDMAB3;         /*!< Device OUT Endpoint 3 Buffer Address Register*/
  __IO uint32_t DOEPCTL4;          /*!< Device Control OUT Endpoint 4 Control Register*/
       uint32_t RESERVED48;
  __IO uint32_t DOEPINT4;          /*!< Device OUT Endpoint 4 Interrupt Register     */
       uint32_t RESERVED49;
  __IO uint32_t DOEPTSIZ4;         /*!< Device OUT Endpoint 4 Transfer Size Register */
  __IO uint32_t DOEPDMA4;          /*!< Device OUT Endpoint 4 DMA Address Register   */
       uint32_t RESERVED50;
  __I  uint32_t DOEPDMAB4;         /*!< Device OUT Endpoint 4 Buffer Address Register*/
  __IO uint32_t DOEPCTL5;          /*!< Device Control OUT Endpoint 5 Control Register*/
       uint32_t RESERVED51;
  __IO uint32_t DOEPINT5;          /*!< Device OUT Endpoint 5 Interrupt Register     */
       uint32_t RESERVED52;
  __IO uint32_t DOEPTSIZ5;         /*!< Device OUT Endpoint 5 Transfer Size Register */
  __IO uint32_t DOEPDMA5;          /*!< Device OUT Endpoint 5 DMA Address Register   */
       uint32_t RESERVED53;
  __I  uint32_t DOEPDMAB5;         /*!< Device OUT Endpoint 5 Buffer Address Register*/
       uint32_t RESERVED54[144];
  __IO uint32_t PCGCCTL;           /*!< Power and Clock Gating Control Register      */
       uint32_t RESERVED55[127];
  __IO uint32_t DFIFO_0;           /*!< Data FIFO Access Register Map 0              */
       uint32_t RESERVED56[1023];
  __IO uint32_t DFIFO_1;           /*!< Data FIFO Access Register Map 1              */
       uint32_t RESERVED57[1023];
  __IO uint32_t DFIFO_2;           /*!< Data FIFO Access Register Map 2              */
       uint32_t RESERVED58[1023];
  __IO uint32_t DFIFO_3;           /*!< Data FIFO Access Register Map 3              */
       uint32_t RESERVED59[1023];
  __IO uint32_t DFIFO_4;           /*!< Data FIFO Access Register Map 4              */
       uint32_t RESERVED60[1023];
  __IO uint32_t DFIFO_5;           /*!< Data FIFO Access Register Map 5              */
       uint32_t RESERVED61[11263];
  __IO uint32_t PHY_CTRL;          /*!< PHY (USBIO) Control Register                 */
  __IO uint32_t PHY_CTRL_SET;      /*!< PHY (USBIO) Control Register                 */
  __IO uint32_t PHY_CTRL_CLR;      /*!< PHY (USBIO) Control Clear Register           */
       uint32_t RESERVED62;
  __IO uint32_t MAC_CTRL0;         /*!< MAC Control Register 0                       */
  __IO uint32_t MAC_CTRL1;         /*!< MAC Control Register 1                       */
  __IO uint32_t MAC_CTRL2;         /*!< MAC Control Register 2                       */
       uint32_t RESERVED63;
  __IO uint32_t WKUP_CTRL0;        /*!< Wakeup Control Register 0                    */
  __IO uint32_t WKUP_CTRL1;        /*!< Wakeup Control Register 1                    */
  __IO uint32_t WKUP_INTEN;        /*!< Wakeup Interrupt Enable Register             */
  __I  uint32_t WKUP_INTFLAG;      /*!< Wakeup Interrupt detection Flag Register     */
  __I  uint32_t WKUP_INTSTS;       /*!< Wakeup Interrupt detection Status Register   */
  __I  uint32_t WKUP_SIGMON;       /*!< Wakeup Interrupt factor Signal monitor Register*/
       uint32_t RESERVED64[2];
  __IO uint32_t VBUS_SIGMON_CTRL;  /*!< VBUS signal monitor Control Register         */
} TSB_USB_TypeDef;

/**
  * @brief 
  */
typedef struct
{
       uint32_t RESERVED0[4];
  __IO uint32_t SBMR;              /*!< Flash Security Bit Mask Register             */
  __IO uint32_t SSR;               /*!< Flash Security Status Register               */
  __O  uint32_t KCR;               /*!< Flash Key Code Register                      */
       uint32_t RESERVED1;
  __IO uint32_t SR0;               /*!< Flash Status Register 0                      */
       uint32_t RESERVED2[3];
  __I  uint32_t PSR0;              /*!< Flash Protect Status Register 0              */
  __I  uint32_t PSR1;              /*!< Flash Protect Status Register 1              */
  __I  uint32_t PSR2;              /*!< Flash Protect Status Register 2              */
       uint32_t RESERVED3[3];
  __I  uint32_t PSR6;              /*!< Flash Protect Status Register 6              */
       uint32_t RESERVED4;
  __IO uint32_t PMR0;              /*!< Flash Protect Mask Register 0                */
  __IO uint32_t PMR1;              /*!< Flash Protect Mask Register 1                */
  __IO uint32_t PMR2;              /*!< Flash Protect Mask Register 2                */
       uint32_t RESERVED5[3];
  __IO uint32_t PMR6;              /*!< Flash Protect Mask Register 6                */
       uint32_t RESERVED6[37];
  __I  uint32_t SR1;               /*!< Flash Status Register 1                      */
  __I  uint32_t SWPSR;             /*!< Flash Memory SWP Status Register             */
       uint32_t RESERVED7[14];
  __IO uint32_t AREASEL;           /*!< Flash Area Selection Register                */
       uint32_t RESERVED8;
  __IO uint32_t CR;                /*!< Flash Control Register                       */
  __IO uint32_t STSCLR;            /*!< Flash Status Clear Register                  */
  __IO uint32_t BNKCR;             /*!< Flash Bank Change Register                   */
  __IO uint32_t ACCR;              /*!< Flash Access Control Register                */
  __IO uint32_t BUFDISCLR;         /*!< Flash Buffer Disable and Clear Register      */
       uint32_t RESERVED9[1071];
  __IO uint32_t RACCR;             /*!< RAM Access Control Register                  */
} TSB_FC_TypeDef;


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


